Тест1/src/Documents/ЭкзаменационныеЛисты/ЭкзаменационныеЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭкзаменационныеЛисты</name>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУчащегося</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднийБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИспытательногоСрока</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.ТемыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>Прослушал</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОценки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЭкзамена</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбучения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещениеПолучено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мотивация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОформленияПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортКемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СемейноеПоложение</name>
    <type>
      <types>EnumRef.СемейноеПоложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоинскаяОбязанность</name>
    <type>
      <types>EnumRef.ВоинскаяОбязанность</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБанковскойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаДляПлатежей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРаботы</name>
    <type>
      <types>CatalogRef.МестоРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Штатный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольДляУК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьДляУК</name>
    <type>
      <types>CatalogRef.ДолжностиДляУК</types>
    </type>
  </attributes>
  <attributes>
    <name>Тележка</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДополнительный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Дети</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПомощникиМенеджера</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиWT10</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ДолжностиДляУК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Documents/ЭкзаменационныеЛисты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УчащийсяПриИзмененииНаСервере()

    Запрос =Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	СотрудникиКонтактнаяИнформация.Ссылка.ОтправлятьСМС КАК ОтправлятьСМС
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	СотрудникиКонтактнаяИнформация.Ссылка.Пользователь = &Пользователь
	|	И СотрудникиКонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонСотрудникаСлужебный);
	Запрос.УстановитьПараметр("Пользователь",объект.Учащийся);
	Телефон = Запрос.Выполнить().Выбрать();
	Телефон.Следующий();
	 
	Объект.ТелефонУчащегося = Телефон.НомерТелефона;

КонецПроцедуры


&НаКлиенте
Процедура УчащийсяПриИзменении(Элемент)

	УчащийсяПриИзмененииНаСервере();
		
КонецПроцедуры



&НаКлиенте
Процедура РезультатыОценкаПриИзменении(Элемент)
	
	///+ГомзМА 04.05.2023
	ТекСтрока = Элементы.Результаты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.Оценка) Тогда
		ТекСтрока.ДатаОценки = ТекущаяДата();
	Иначе
		ТекСтрока.ДатаОценки = '00010101';
	КонецЕсли;
	///-ГомзМА 04.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	///+ГомзМА 05.06.2023
	Для каждого СтрокаТЧ Из Объект.Результаты Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаОбучения) Тогда
			Если СтрокаТЧ.ДатаОбучения > ТекущаяДата() И НЕ СтрокаТЧ.ОповещениеПолучено Тогда
				ЗаписатьНапоминаниеВРегистреСведений(Объект.Учащийся, СтрокаТЧ.ДатаОбучения, СтрокаТЧ.Тема);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для каждого СтрокаТЧ Из Объект.Результаты Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаОбучения) Тогда
			Если СтрокаТЧ.ДатаОбучения > ТекущаяДата() И НЕ СтрокаТЧ.ОповещениеПолучено Тогда
				СтрокаТЧ.ОповещениеПолучено = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	///-ГомзМА 05.06.2023
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНапоминаниеВРегистреСведений(Учащийся, ДатаОбучения, Тема)

	//Запись напоминания об обучении пользователю
	СтрокаВывода = СтрШаблон("%1, Вам назначена дата обучения: %2 по теме ""%3""", Учащийся, ДатаОбучения, Тема);
	ЗаписьВРегистреСведений = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
	ЗаписьВРегистреСведений.ВремяСобытия = ТекущаяДатаСеанса() + 60;
	ЗаписьВРегистреСведений.СрокНапоминания = ТекущаяДатаСеанса() + 60;
	ЗаписьВРегистреСведений.Пользователь = Учащийся;
	ЗаписьВРегистреСведений.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
	ЗаписьВРегистреСведений.Описание = СтрокаВывода;
	ЗаписьВРегистреСведений.Записать();

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьЭкзЛиста(Команда)
	ТабДок = Печать(Объект.ссылка);
	
	// создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Печать");
	// Добавляем в коллекцию (тип массив) сформированный Табличный документ
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	// если требуется устанавливаем параметры печати
	КоллекцияПечатныхФорм[0].Экземпляров=1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Печать";  // используется для формирования имени файла при сохранении из общей формы печати документов
	// .. и выводим стандартной процедурой БСП
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Функция Печать(Ссылка)
	ТабДок = Новый ТабличныйДокумент;

	Макет = Документы.ЭкзаменационныеЛисты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭкзаменационныеЛисты.Дата,
	|	ЭкзаменационныеЛисты.Наименование,
	|	ЭкзаменационныеЛисты.Номер,
	|	ЭкзаменационныеЛисты.Преподаватель,
	|	ЭкзаменационныеЛисты.ТелефонУчащегося,
	|	ЭкзаменационныеЛисты.Учащийся,
	|	ЭкзаменационныеЛисты.Результаты.(
	|		НомерСтроки,
	|		Тема,
	|		Прослушал,
	|		Балл,
	|		Оценка
	|	)
	|ИЗ
	|	Документ.ЭкзаменационныеЛисты КАК ЭкзаменационныеЛисты
	|ГДЕ
	|	ЭкзаменационныеЛисты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРезультатыШапка = Макет.ПолучитьОбласть("РезультатыШапка");
	ОбластьРезультаты = Макет.ПолучитьОбласть("Результаты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРезультатыШапка);
		ВыборкаРезультаты = Выборка.Результаты.Выбрать();
		Пока ВыборкаРезультаты.Следующий() Цикл
			ОбластьРезультаты.Параметры.Заполнить(ВыборкаРезультаты);
			ТабДок.Вывести(ОбластьРезультаты, ВыборкаРезультаты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	ТабДок.АвтоМасштаб = Истина;
	Возврат табдок; 

КонецФункции

&НаКлиенте
Процедура РезультатыДатаОбученияПриИзменении(Элемент)
	
	///+ГомзМА 31.05.2023
	ТекСтрока = Элементы.Результаты.ТекущиеДанные;
	
	Если ТекСтрока.ОповещениеПолучено Тогда
		ТекСтрока.ОповещениеПолучено = Ложь;
	КонецЕсли;
	///-ГомзМА 31.05.2023
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	/////+ГомзМА 01.06.2023
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь КАК СотрудникПользователь,
	//	|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь.Подразделение КАК СотрудникПользовательПодразделение,
	//	|	ДолжностиСотрудниковСрезПоследних.Регистратор.Город КАК РегистраторГород,
	//	|	ДолжностиСотрудниковСрезПоследних.Регистратор КАК Регистратор,
	//	|	ДолжностиСотрудниковСрезПоследних.Регистратор.Дата КАК РегистраторДата
	//	|ИЗ
	//	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних(, ) КАК ДолжностиСотрудниковСрезПоследних
	//	|ГДЕ
	//	|	НЕ ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь.Недействителен
	//	|	И ДолжностиСотрудниковСрезПоследних.Регистратор ССЫЛКА Документ.КадровыйПриказ
	//	|	И ДолжностиСотрудниковСрезПоследних.Сотрудник = &Сотрудник
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ДолжностиСотрудниковСрезПоследних.Регистратор.Дата УБЫВ";
	//
	//Запрос.УстановитьПараметр("Сотрудник", Объект.Учащийся);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//РезультатЗапроса.Следующий();
	

	///-ГомзМА 01.06.2023
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПриИзменении(Элемент)
	
	///+ГомзМА 02.06.2023
	Если Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Записать();
	КонецЕсли;
	///-ГомзМА 02.06.2023
	
КонецПроцедуры


#КонецОбласти
